# 1. Pandas

- 구조화된 데이터의 처리를 지원하는 Python 라이브러리. Python계의 엑셀!

## Pandas란?

- 구조화된 데이터의 처리를 지원하는 Python 라이브러리
- 고성능 Array 계산 라이브러리인 Numpy와 통합하여, 강력한 “스프레드시트” 처리 기능을 제공
- Pandas는 Numpy의 wapper. 즉, Numpy의 데이터 타입을 그대로 불러와서 사용할 수 있다.
- 인덱싱, 연산용함수, 전처리함수등을제공함

In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

위의 세 줄은 고정으로 import 시켜놓고 가자.

## 데이터 로딩

In [2]:
data_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data' # Data URL

Boston housing 문제의 데이터는 다음과 같이 되어있다.

<img src="../../img/Screen Shot 2019-03-17 at 5.06.15 PM.png" width="700">

In [3]:
df_data = pd.read_csv(data_url, sep='\s+', header = None) # csv 타입 데이터 로드, separate는 빈공간으로 지정하고, Column은 없음

'\s+'의 경우, '\s'는 정규 표현식으로서 공백문자(space)를 의미한다. 따라서 '\s+'는 "빈 칸으로 나눠서 띄워져 있는 것들은 다 가져와라." 라는 뜻으로 이해하면 된다.

그리고 header는 첫 줄에 column 이름들이 들어가 있는 지를 보는 paremeter이다. 없으면 None을 주면 된다.

In [4]:
df_data.head() # 처음 다섯줄 출력

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

head를 찍으면 처음 5칸을 보여준다.

column들이 없었으니 column을 따로 설정해보자.

In [5]:
df_data.columns = [
    'CRIM','ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD', 'TAX', 'PTRATIO' ,'B', 'LSTAT', 'MEDV'] 
# Column Header 이름 지정

In [6]:
df_data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

---

# 2. Series

## Pandas의 구성

<img src="../../img/Screen Shot 2019-03-17 at 5.24.59 PM.png" width="700">

Pandas는 기본적으로 Series와 DataFrame이라고 하는 두 가지 Object로 구성되어 있다.

Series라는 것은 간단하게 말해서 numpy에서의 하나의 vector

## 일반적인 pandas의 활용

<img src="../../img/Screen Shot 2019-03-17 at 5.28.58 PM.png" width="800">

## Series

- Column Vector를 표현하는 object

~~~python
example_obj = Series()
~~~

<img src="../../img/Screen Shot 2019-03-17 at 5.34.43 PM.png" width="700">

In [7]:
list_data = [1,2,3,4,5]

In [8]:
example_obj = Series(data = list_data) # data에는 dict도 가능

In [9]:
print(example_obj)

0    1
1    2
2    3
3    4
4    5
dtype: int64

- index & values(data)

<img src="../../img/Screen Shot 2019-03-17 at 5.38.19 PM.png" width="500">

Series에서는 index를 신경쓰지 않아도 되지만 나중에 DataFrame에서 index를 신경쓰면 되고 DataFrame에서는 index가 중복이 가능하다.

In [10]:
list_name = ["a","b","c","d","e"]
list_data = [1,2,3,4,5]

In [11]:
example_obj = Series(data = list_data, index=list_name) # index 이름을 지정

In [12]:
print(example_obj)

a    1
b    2
c    3
d    4
e    5
dtype: int64

다음과 같이 직접적으로 접근도 가능하다.

In [13]:
print(example_obj.index)

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [14]:
print(example_obj.values)

[1 2 3 4 5]

In [15]:
print(type(example_obj.values))

<class 'numpy.ndarray'>

다음과 같이 dictionary도 가능하다.

In [16]:
dict_data = {"a":1, "b":2, "c":3, "d":4, "e":5}

In [17]:
example_obj = Series(dict_data, dtype=np.float32, name="example_data") 
# name - series 이름 설정. 쉽게 말해 하나의 column 이름 설정.

In [18]:
print(example_obj)

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

- Series의 인덱싱

In [19]:
print(example_obj["a"]) # numpy와 다른점

1.0

다음과 같이 직접적으로 접근해서 값을 변경할 수도 있다.

In [20]:
example_obj["a"] = 3.2

In [21]:
print(example_obj)

a    3.2
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

다음과 같은 것들도 가능하다.

In [22]:
print(example_obj[example_obj > 2])

a    3.2
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

In [23]:
print(example_obj * 2)

a     6.4
b     4.0
c     6.0
d     8.0
e    10.0
Name: example_data, dtype: float32

- Data에 대한 정보 저장

In [24]:
example_obj.name = "number" # series 이름 변경
example_obj.index.name = "alphabet" # index 이름 변경

In [25]:
print(example_obj)

alphabet
a    3.2
b    2.0
c    3.0
d    4.0
e    5.0
Name: number, dtype: float32

- index 값을 기준으로 series 생성

In [26]:
dict_data_1 = {"a":1, "b":2, "c":3, "d":4, "e":5}
indexes = ["a","b","c","d","e","f","g","h"]

In [27]:
series_obj_1 = Series(dict_data_1, index=indexes)

In [28]:
print(series_obj_1)

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    NaN
g    NaN
h    NaN
dtype: float64

---

# 3. Dataframe

- Series를 모아서 만든 Data Table = **기본 2차원**

<img src="../../img/Screen Shot 2019-03-17 at 6.46.23 PM.png" width="600">

DataFrame에서는 index와 columns 두 가지로 data를 찾을 수 있다.

~~~python
DataFrame()
~~~

<img src="../../img/Screen Shot 2019-03-17 at 7.52.22 PM.png" width="650">

In [29]:
# Example from - https://chrisalbon.com/python/pandas_map_values_to_values.html
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
            'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
            'age': [42, 52, 36, 24, 73],
            'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}

In [30]:
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city'])

In [31]:
print(df)

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

대부분 csv파일을 이용해서 불러오기 때문에 위와 같이 dict 타입으로는 잘 쓰지 않는다.

- column 선택 (numpy와 다른점)

In [32]:
df = DataFrame(raw_data, columns = ["age", "city"])

In [33]:
print(df)

   age           city
0   42  San Francisco
1   52      Baltimore
2   36          Miami
3   24        Douglas
4   73         Boston

- 새로운 column 추가

In [34]:
df = DataFrame(raw_data, columns = ["first_name","last_name", "age", "city", "debt"])

In [35]:
print(df)

  first_name last_name  age           city debt
0      Jason    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

- column 선택 - series 추출

property를 아래와 같이 두 가지 방식으로 쓸 수 있다.

In [36]:
print(df.first_name)

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [37]:
print(df["first_name"])

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

- loc & iloc
    - loc(index location) - index 이름
    - iloc(index position) - index number
    
대체적으로 loc은 잘 안씀

In [38]:
print(df.loc[2:]) # row values

  first_name last_name  age     city debt
2       Tina       Ali   36    Miami  NaN
3       Jake    Milner   24  Douglas  NaN
4        Amy     Cooze   73   Boston  NaN

In [39]:
print(df["first_name"].iloc[2:]) # column values

2    Tina
3    Jake
4     Amy
Name: first_name, dtype: object

df["first_name"]만 하게 되면 series가 튀어나온다.

다른 것으로 비교해보자.

In [40]:
# Example from - https://stackoverflow.com/questions/31593201/pandas-iloc-vs-ix-vs-loc-explanation
s = pd.Series(np.nan, index=[49,48,47,46,45, 1, 2, 3, 4, 5])

In [41]:
print(s.loc[:3]) # index의 이름이 3이라는 것까지 실행해라.

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

loc은 위와 같이 index의 이름이 3인 것까지 출력하는 것을 볼 수 있다.

In [42]:
print(s.iloc[:3])

49   NaN
48   NaN
47   NaN
dtype: float64

iloc은 위와 같이 0, 1, 2 즉, index의 number가 3번째 전까지 출력하는 것을 볼 수 있다.

- column에 새로운 data 할당 (많이 사용하는 기법)

In [43]:
df.debt = df.age > 40

In [44]:
print(df)

  first_name last_name  age           city   debt
0      Jason    Miller   42  San Francisco   True
1      Molly  Jacobson   52      Baltimore   True
2       Tina       Ali   36          Miami  False
3       Jake    Milner   24        Douglas  False
4        Amy     Cooze   73         Boston   True

- transpose

In [45]:
df = df.T

In [46]:
print(df)

                        0          1      2        3       4
first_name          Jason      Molly   Tina     Jake     Amy
last_name          Miller   Jacobson    Ali   Milner   Cooze
age                    42         52     36       24      73
city        San Francisco  Baltimore  Miami  Douglas  Boston
debt                 True       True  False    False    True

- DataFrame에 들어가있는 값 출력

In [47]:
print(df.values)

[['Jason' 'Molly' 'Tina' 'Jake' 'Amy']
 ['Miller' 'Jacobson' 'Ali' 'Milner' 'Cooze']
 [42 52 36 24 73]
 ['San Francisco' 'Baltimore' 'Miami' 'Douglas' 'Boston']
 [True True False False True]]

- csv로 변환

In [48]:
df_csv = df.to_csv()

In [49]:
print(df_csv)

,0,1,2,3,4
first_name,Jason,Molly,Tina,Jake,Amy
last_name,Miller,Jacobson,Ali,Milner,Cooze
age,42,52,36,24,73
city,San Francisco,Baltimore,Miami,Douglas,Boston
debt,True,True,False,False,True

- column 삭제

In [50]:
df = df.T
print(df)

  first_name last_name age           city   debt
0      Jason    Miller  42  San Francisco   True
1      Molly  Jacobson  52      Baltimore   True
2       Tina       Ali  36          Miami  False
3       Jake    Milner  24        Douglas  False
4        Amy     Cooze  73         Boston   True

In [51]:
del df["debt"]

In [52]:
print(df)

  first_name last_name age           city
0      Jason    Miller  42  San Francisco
1      Molly  Jacobson  52      Baltimore
2       Tina       Ali  36          Miami
3       Jake    Milner  24        Douglas
4        Amy     Cooze  73         Boston

---

# 4. Selection & Drop

- 가져올 것들은 가져오고, 지울 것들은 지우고 하는 방법 소개

In [53]:
!pip install xlrd

Requirement already satisfied: xlrd in /usr/local/var/pyenv/versions/3.6.5/envs/dm-env/lib/python3.6/site-packages (1.2.0)

In [54]:
df = pd.read_excel("./excel_comp_data.xlsx")

In [55]:
print(df)

    account                              name  \
0    211829        Kerluke, Koepp and Hilpert
1    320563                    Walter-Trantow
2    648336        Bashirian, Kunde and Price
3    109996       D'Amore, Gleichner and Bode
4    121213                     Bauch-Goldner
5    132971  Williamson, Schumm and Hettinger
6    145068                        Casper LLC
7    205217                  Kovacek-Johnston
8    209744                    Champlin-Morar
9    212303                    Gerhold-Maggio
10   214098       Goodwin, Homenick and Jerde
11   231907                        Hahn-Moore
12   242368      Frami, Anderson and Donnelly
13   268755                       Walsh-Haley
14   273274                     McDermott PLC

                                  street               city          state  \
0                     34456 Sean Highway         New Jaycob          Texas
1                      1311 Alvis Tunnel      Port Khadijah  NorthCarolina
2   62184 Schamberger Underpass Apt. 231     New Lilianland           Iowa
3            155 Fadel Crescent Apt. 144         Hyattburgh          Maine
4                    7274 Marissa Common    Shanahanchester     California
5                   89403 Casimer Spring       Jeremieburgh       Arkansas
6           340 Consuela Bridge Apt. 400  Lake Gabriellaton     Mississipi
7           91971 Cronin Vista Suite 601         Deronville    RhodeIsland
8                       26739 Grant Lock    Lake Juliannton   Pennsylvania
9              366 Maggio Grove Apt. 998          North Ras          Idaho
10             649 Cierra Forks Apt. 078           Rosaberg       Tenessee
11              18115 Olivine Throughway      Norbertomouth    NorthDakota
12                       182 Bertie Road        East Davian           Iowa
13                  2624 Beatty Parkways       Goodwinmouth    RhodeIsland
14                 8917 Bergstrom Meadow    Kathryneborough       Delaware

    postal-code     Jan     Feb     Mar
0         28752   10000   62000   35000
1         38365   95000   45000   35000
2         76517   91000  120000   35000
3         46021   45000  120000   10000
4         49681  162000  120000   35000
5         62785  150000  120000   35000
6         18008   62000  120000   70000
7         53461  145000   95000   35000
8         64415   70000   95000   35000
9         46308   70000  120000   35000
10        47743   45000  120000   55000
11        31415  150000   10000  162000
12        72686  162000  120000   35000
13        31919   55000  120000   35000
14        27933  150000  120000   70000

##  Selection with column names

- 1개의 column name 선택

series 객체를 가져온다.

In [56]:
df["account"].head(3)

0    211829
1    320563
2    648336
Name: account, dtype: int64

- 1개 이상의 column names 선택

여러 개의 column name을 가져오고 싶을 때는 반드시 [ ]으로 묶어서 넣어주어야 한다. 그리고 위와 다르게 dataframe 객체를 가져온다.

In [57]:
df[["account", "street", "state"]].head(3)

   account                                street          state
0   211829                    34456 Sean Highway          Texas
1   320563                     1311 Alvis Tunnel  NorthCarolina
2   648336  62184 Schamberger Underpass Apt. 231           Iowa

##  Selection with index number

- column 이름 없이 사용하는 index number는 row를 기준 가져옴

In [58]:
df[:3]

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000

- column이름과 함께 row index 사용시, 해당 column만

In [59]:
df["account"][:3]

0    211829
1    320563
2    648336
Name: account, dtype: int64

앞에 column을 지정해주었기 때문에 series data로 변했다.

## Series selection

In [60]:
account_serires = df["account"]

In [61]:
account_serires[:3]

0    211829
1    320563
2    648336
Name: account, dtype: int64

- 1개 이상의 index

In [62]:
account_serires[[1,5,2]]

1    320563
5    132971
2    648336
Name: account, dtype: int64

- Boolean index

In [63]:
account_serires[account_serires < 250000]

0     211829
3     109996
4     121213
5     132971
6     145068
7     205217
8     209744
9     212303
10    214098
11    231907
12    242368
Name: account, dtype: int64

##  Index 변경

- 고유한 번호가 있는 경우, 따로 index를 두기 보다 그 값을 index로 해서 쓰고 싶은 경우도 있다. 그럴 경우 다음과 같이 하면 된다.
- del을 해주는 것은 원래의 account가 남기 때문이다.

In [64]:
df.index = df["account"]

In [65]:
del df["account"]

In [66]:
df.head()

,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,
211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

## Basic, loc, iloc selection

- Column과 index number (column의 숫자가 많을 경우 쓰는 방법)

In [67]:
df[["name","street"]][:2]

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

- Column과 index name (거의 안쓰는 방법)

In [68]:
df.loc[[211829,320563],["name","street"]]

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

- Column number와 index number (제일 많이 쓰는 방법)

column이 몇 개 없을 떄는 iloc이 제일 편하다.

In [69]:
df.iloc[:2,:2]

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

개인적으로 iloc을 많이 쓸 것 같다. column에 대해서도 슬라이싱을 할 때 다음과 같이 쓰면 편하다.

In [70]:
df["name"].iloc[2:]

account
648336          Bashirian, Kunde and Price
109996         D'Amore, Gleichner and Bode
121213                       Bauch-Goldner
132971    Williamson, Schumm and Hettinger
145068                          Casper LLC
205217                    Kovacek-Johnston
209744                      Champlin-Morar
212303                      Gerhold-Maggio
214098         Goodwin, Homenick and Jerde
231907                          Hahn-Moore
242368        Frami, Anderson and Donnelly
268755                         Walsh-Haley
273274                       McDermott PLC
Name: name, dtype: object

## index 재설정

In [71]:
df.index = list(range(0,15))

In [72]:
df.head()

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

index 이름만 account로 돌려놓자. (values들은 사라짐..)

In [73]:
df.index.name = "account"

In [74]:
df.head()

,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

##  Data drop

- index number로 drop
- column 단위로 없애줄 때는 del을 이용 ex) del df["debt"]
- row 단위로 없앨 때 사용
- drop을 쓰는 경우는 크게 없음
- 잘 못 들어온 data를 날릴 때 주로 사용

In [75]:
df.drop(1)

,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
6,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000
7,Kovacek-Johnston,91971 Cronin Vista Suite 601,Deronville,RhodeIsland,53461,145000,95000,35000
8,Champlin-Morar,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000
9,Gerhold-Maggio,366 Maggio Grove Apt. 998,North Ras,Idaho,46308,70000,120000,35000
10,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Rosaberg,Tenessee,47743,45000,120000,55000
11,Hahn-Moore,18115 Olivine Throughway,Norbertomouth,NorthDakota,31415,150000,10000,162000
12,"Frami, Anderson and Donnelly",182 Bertie Road,East Davian,Iowa,72686,162000,120000,35000
13,Walsh-Haley,2624 Beatty Parkways,Goodwinmouth,RhodeIsland,31919,55000,120000,35000
14,McDermott PLC,8917 Bergstrom Meadow,Kathryneborough,Delaware,27933,150000,120000,70000

- 한개 이상의 Index number로 drop

In [76]:
df.drop([0,1,2,3])

,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
6,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000
7,Kovacek-Johnston,91971 Cronin Vista Suite 601,Deronville,RhodeIsland,53461,145000,95000,35000
8,Champlin-Morar,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000
9,Gerhold-Maggio,366 Maggio Grove Apt. 998,North Ras,Idaho,46308,70000,120000,35000
10,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Rosaberg,Tenessee,47743,45000,120000,55000
11,Hahn-Moore,18115 Olivine Throughway,Norbertomouth,NorthDakota,31415,150000,10000,162000
12,"Frami, Anderson and Donnelly",182 Bertie Road,East Davian,Iowa,72686,162000,120000,35000
13,Walsh-Haley,2624 Beatty Parkways,Goodwinmouth,RhodeIsland,31919,55000,120000,35000
14,McDermott PLC,8917 Bergstrom Meadow,Kathryneborough,Delaware,27933,150000,120000,70000

- axis 지정으로 축을 기준으로 drop -> column 중에 “city”

그냥 del이 더 편하다.

In [77]:
df.drop("city", axis=1)

,name,street,state,postal-code,Jan,Feb,Mar
account,,,,,,,
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Arkansas,62785,150000,120000,35000
6,Casper LLC,340 Consuela Bridge Apt. 400,Mississipi,18008,62000,120000,70000
7,Kovacek-Johnston,91971 Cronin Vista Suite 601,RhodeIsland,53461,145000,95000,35000
8,Champlin-Morar,26739 Grant Lock,Pennsylvania,64415,70000,95000,35000
9,Gerhold-Maggio,366 Maggio Grove Apt. 998,Idaho,46308,70000,120000,35000
10,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Tenessee,47743,45000,120000,55000
11,Hahn-Moore,18115 Olivine Throughway,NorthDakota,31415,150000,10000,162000
12,"Frami, Anderson and Donnelly",182 Bertie Road,Iowa,72686,162000,120000,35000
13,Walsh-Haley,2624 Beatty Parkways,RhodeIsland,31919,55000,120000,35000
14,McDermott PLC,8917 Bergstrom Meadow,Delaware,27933,150000,120000,70000

실제로 데이터가 사라지지는 않는다. pandas에서는 원본 데이터를 삭제를 쉽게 안한다. 원본 데이터를 변환해주고 싶으면 반드시 inplace=True를 추가로 적어주어야한다. inplace=False를 하면 copy본을 따로 만든다. 그리고 그 copy본에서 삭제를 한다. 이부분은 밑에 Replace function에서 다시 보자.

참고로 axis는 0이 항상 가장 큰 차원(축)이고, 숫자가 크면 클수록 작은 차원(축)이 된다.

---

# 5. Dataframe Operations

## Series operation

- index을 기준으로 연산수행
- 겹치는 index가 없을 경우 NaN값으로 반환

In [78]:
s1 = Series(range(1,6), index=list("abced"))

In [79]:
print(s1)

a    1
b    2
c    3
e    4
d    5
dtype: int64

In [80]:
s2 = Series(range(5,11), index=list("bcedef"))

In [81]:
print(s2)

b     5
c     6
e     7
d     8
e     9
f    10
dtype: int64

In [82]:
s1.add(s2)

a     NaN
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f     NaN
dtype: float64

In [83]:
print(s1 + s2)

a     NaN
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f     NaN
dtype: float64

## Dataframe operation

- df는 column과 index를 모두 고려
- add operation을 쓰면 NaN값 0으로 변환 
- Operation types: add, sub, div, mul

In [84]:
df1 = DataFrame(np.arange(9).reshape(3,3), columns=list("abc"))

In [85]:
print(df1)

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [86]:
df2 = DataFrame(np.arange(16).reshape(4,4), columns=list("abcd"))

In [87]:
print(df2)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [88]:
print(df1 + df2)

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [89]:
df1.add(df2, fill_value=0)

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

## Series + Dataframe

- column을 기준으로 broadcasting이 발생함

In [90]:
df = DataFrame(np.arange(16).reshape(4,4), columns=list("abcd"))

In [91]:
print(df)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [92]:
s = Series(np.arange(10,14), index=list("abcd"))

In [93]:
print(s)

a    10
b    11
c    12
d    13
dtype: int64

In [94]:
print(df + s)

    a   b   c   d
0  10  12  14  16
1  14  16  18  20
2  18  20  22  24
3  22  24  26  28

반대로 row를 기준으로 broadcasting을 할 수도 있다.

In [95]:
s2 = Series(np.arange(10,14))

In [96]:
print(df)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [97]:
print(s2)

0    10
1    11
2    12
3    13
dtype: int64

In [98]:
df.add(s2, axis=0)

    a   b   c   d
0  10  11  12  13
1  15  16  17  18
2  20  21  22  23
3  25  26  27  28

---

# 6. Lambda, Map, Apply

- 실제로 상당히 실용적인 내용!
- Map이나 Replace를 써서 데이터를 변경해줄 때 많이 쓴다. 
- Map - series 추가, 데이터 변환 / Replace - 데이터 변환만
- Apply는 element 단위가 아니라 series 단위로 min, max, mean, sum 등을 구할 때 많이 사용. 통계 데이터 구할 때 많이 사용
- Applymap for dataframe은 전체적으로 element 단위에 적용할 때 사용

## Lambda 함수

- 한 줄로 함수를 표현하는 익명 함수 기법
- Lisp 언어에서 시작된 기법으로 오늘날 현대언어에 많이 사용
- **lambda** argument : expression

In [99]:
f = lambda x,y: x + y

In [100]:
print(f(1,4))

5

이름을 할당하지 않고도 가능하다.

In [101]:
(lambda x: x +1)(5)

6

## Map 함수

- 함수와 sequence형 데이터를 인자로 받아
- **각 element마다** 입력받은 함수를 적용하여 list로 반환 
- 일반적으로 함수를 lambda형태로 표현함
- **map** (function, sequence)

In [102]:
ex = [1,2,3,4,5]
f = lambda x: x ** 2

In [103]:
print(list(map(f, ex)))

[1, 4, 9, 16, 25]

두 개이상의 argument가 있을 때는 두 개의 sequence형을 써야한다.

In [104]:
f = lambda x, y: x + y

In [105]:
print(list(map(f, ex, ex)))

[2, 4, 6, 8, 10]

lambda와 같이 익명 함수 그대로 사용할 수도 있다.

In [106]:
list(map(lambda x: x+x, ex))

[2, 4, 6, 8, 10]

## Map for series

- Pandas의 series type의 데이터에도 map 함수 사용가능 
- function 대신 dict, sequence형 자료등으로 대체 가능
- 실제로 많이 사용
- 데이터를 직접적으로 추가하거나 변환해줄 때 사용

In [107]:
s1 = Series(np.arange(10))

In [108]:
s1.head(5)

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [109]:
s1.map(lambda x: x**2).head(5)

0     0
1     1
2     4
3     9
4    16
dtype: int64

- dict type으로 데이터 교체. 없는 값은 NaN

10대, 20대, 30대를 구분한다거나 할 때 유용하게 **데이터를 변환** 해줄 수 있다.

In [110]:
z = {1: 'A', 2: 'B', 3: 'C'}

In [111]:
s1.map(z).head(5)

0    NaN
1      A
2      B
3      C
4    NaN
dtype: object

- 같은 위치의 데이터를 s2로 전환

In [112]:
s2 = Series(np.arange(10,20))

In [113]:
s1.map(s2).head(5)

0    10
1    11
2    12
3    13
4    14
dtype: int64

## Example - map for series

- 제일 많이 쓰는 일반적인 테크닉

In [114]:
df = pd.read_csv("wages.csv")

In [115]:
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [116]:
df.sex.unique()

array(['male', 'female'], dtype=object)

map을 통해 sex_code이라는 **series를 추가** 해보자.

In [117]:
df["sex_code"] = df.sex.map({"male":0, "female":1})

In [118]:
df.head()

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

## Replace function

- Map함수의 기능 중 **데이터 변환 기능만** 담당
- 데이터 변환 시 많이 사용하는 함수

In [119]:
df.sex.replace({"male":0, "female":1}).head()

0    0
1    1
2    1
3    1
4    1
Name: sex, dtype: int64

In [120]:
df.sex.replace(["male", "female"], # Target list
               [0,1],              # Conversion list
               inplace=True)       # 데이터 변환 결과를 적용

In [121]:
df.head()

           earn  height  sex   race  ed  age  sex_code
0  79571.299011   73.89    0  white  16   49         0
1  96396.988643   66.23    1  white  16   62         1
2  48710.666947   63.77    1  white  16   33         1
3  80478.096153   63.22    1  other  16   95         1
4  82089.345498   63.08    1  white  17   43         1

## Apply for dataframe

- map에서 했던 element 단위가 아닌, series **전체(column)에 해당** 함수를 적용
- 입력값이 series 데이터로 입력받아 handling 가능
- 통계 데이터를 뽑을 때 유용하게 사용

In [122]:
df = pd.read_csv("wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [123]:
df_info = df[["earn", "height","age"]]
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [124]:
f = lambda x : x.max() - x.min()

아래와 같이 각 column 별로 결과값 반환된다.

In [125]:
df_info.apply(f)

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

- 내장 연산 함수를 사용할 때도 똑같은 효과를 거둘 수 있음 
- mean, std 등 사용가능

In [126]:
df_info.sum()

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [127]:
df_info.apply(sum)

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

- scalar 값 이외에 series값의 반환도 가능함

In [128]:
f = lambda x : Series([x.min(), x.max(), x.mean()], 
                      index=["min", "max", "mean"])

In [129]:
df_info.apply(f)

               earn    height        age
min      -98.580489  57.34000  22.000000
max   317949.127955  77.21000  95.000000
mean   32446.292622  66.59264  45.328499

## Applymap for dataframe

- series 단위가 아닌 전체 dataframe의 **element 단위로** 함수를 적용함 
- series 단위에 apply를 적용시킬 때와 같은 효과

In [130]:
f = lambda x : -x

In [131]:
df_info.applymap(f).head(5)

           earn  height  age
0 -79571.299011  -73.89  -49
1 -96396.988643  -66.23  -62
2 -48710.666947  -63.77  -33
3 -80478.096153  -63.22  -95
4 -82089.345498  -63.08  -43

아래와 같이 apply를 이용하여 해당 series에 적용한 것과 동일한 효과를 볼 수 있다.

In [132]:
df_info["earn"].apply(f).head(5)

0   -79571.299011
1   -96396.988643
2   -48710.666947
3   -80478.096153
4   -82089.345498
Name: earn, dtype: float64

---

# 7. Pandas Built-in functions

## describe

- Numeric type 데이터의 요약 정보를 보여줌
- 각 column들마다 통계자료들을 싹 다 뽑아준다. 제일 많이 쓰는 것 중에 하나!

In [133]:
df = pd.read_csv("./wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [134]:
df.describe()

                earn       height           ed          age
count    1379.000000  1379.000000  1379.000000  1379.000000
mean    32446.292622    66.592640    13.354605    45.328499
std     31257.070006     3.818108     2.438741    15.789715
min       -98.580489    57.340000     3.000000    22.000000
25%     10538.790721    63.720000    12.000000    33.000000
50%     26877.870178    66.050000    13.000000    42.000000
75%     44506.215336    69.315000    15.000000    55.000000
max    317949.127955    77.210000    18.000000    95.000000

## unique

- series data의 유일한 값을 list를 반환함. 다시 말해 series data의 category set을 보여준다.
- 유일한 인종의 값 list 출력

category형 데이터가 몇 개가 있는 지 모를 때 많이 사용한다.

In [135]:
df.race.unique()

array(['white', 'other', 'hispanic', 'black'], dtype=object)

## label str - > index 값으로 변환

- dict type으로 index

In [136]:
np.array(dict(enumerate(sorted(df["race"].unique()))))

array({0: 'black', 1: 'hispanic', 2: 'other', 3: 'white'}, dtype=object)

- label index 값과 label 값 각각 추출

In [137]:
value = list(map(int, np.array(list(enumerate(df["race"].unique())))[:, 0].tolist()))
key = np.array(list(enumerate(df["race"].unique())), dtype=str)[:, 1].tolist()

int로 변환해주기 위해 map 사용. map 앞에는 무조건 list가 붙어야함.

In [138]:
print(value)
print(key)

[0, 1, 2, 3]
['white', 'other', 'hispanic', 'black']

- label str - > index 값으로 변환

In [139]:
df["race"].head()

0    white
1    white
2    white
3    other
4    white
Name: race, dtype: object

In [140]:
df["race"].replace(to_replace=key, value=value, inplace=True)

In [141]:
df.head()

           earn  height     sex  race  ed  age
0  79571.299011   73.89    male     0  16   49
1  96396.988643   66.23  female     0  16   62
2  48710.666947   63.77  female     0  16   33
3  80478.096153   63.22  female     1  16   95
4  82089.345498   63.08  female     0  17   43

위와 같이 labeling coding을 할 때 pandas를 이용해서 쉽게 변환해줄 수 있다. string값들을 다 int로 바꿔줘서 label을 만드는 것. 위에서 배웠던 replace로도 가능하다.

- 성별에 대해서도 동일하게 적용

In [142]:
value = list(map(int, np.array(list(enumerate(df["sex"].unique())))[:, 0].tolist()))
key = np.array(list(enumerate(df["sex"].unique())), dtype=str)[:, 1].tolist()

In [143]:
print(value)
print(key)

[0, 1]
['male', 'female']

- ”sex”와 “race” column의 index labelling

In [144]:
df["sex"].head()

0      male
1    female
2    female
3    female
4    female
Name: sex, dtype: object

In [145]:
df["sex"].replace(to_replace=key, value=value, inplace=True)

In [146]:
df.head()

           earn  height  sex  race  ed  age
0  79571.299011   73.89    0     0  16   49
1  96396.988643   66.23    1     0  16   62
2  48710.666947   63.77    1     0  16   33
3  80478.096153   63.22    1     1  16   95
4  82089.345498   63.08    1     0  17   43

## sum

- 기본적인 column 또는 row 값의 연산을 지원
- sub, mean, min, max, count, median, mad, var 등

In [147]:
df.sum(axis=0) # axis - 아래 화살표를 손으로 표시하고 오른쪽으로 이동

earn      4.474344e+07
height    9.183125e+04
sex       8.590000e+02
race      5.610000e+02
ed        1.841600e+04
age       6.250800e+04
dtype: float64

In [148]:
df.sum(axis=1).head() # axis - 오른쪽 화살표를 손으로 표시하고 아래로 이동

0    79710.189011
1    96542.218643
2    48824.436947
3    80654.316153
4    82213.425498
dtype: float64

## isnull

- column 또는 row 값의 NaN (null) 값의 index를 반환함

In [149]:
df.isnull().head()

    earn  height    sex   race     ed    age
0  False   False  False  False  False  False
1  False   False  False  False  False  False
2  False   False  False  False  False  False
3  False   False  False  False  False  False
4  False   False  False  False  False  False

- Null인 값의 합

In [150]:
df.isnull().sum()

earn      0
height    0
sex       0
race      0
ed        0
age       0
dtype: int64

## sort_values

- column 값을 기준으로 데이터를 sorting

In [151]:
df.sort_values(["age", "earn"], ascending=False).head(10) # ascending=Ture 하면 오름차순

              earn  height  sex  race  ed  age
3     80478.096153   63.22    1     1  16   95
809   42963.362005   72.94    0     0  12   95
331   39169.750135   64.79    1     0  12   95
102   39751.194030   67.14    0     0  12   93
993   32809.632677   59.61    1     1  16   92
1017   8942.806716   62.97    1     0  10   91
1192  39757.947210   64.79    0     0  16   90
952    8162.682672   58.09    1     0   5   89
827   55712.348432   70.13    0     0   9   88
939   40744.874765   59.15    1     0  15   87

---

지금까지는 pandas로 데이터들을 불러오고 계산하는 것들을 했다면, 여기서부터는 feature라는 거대한 모판을 만들기 위해 데이터들을 나누고 붙이는 것들을 할 것이다. 일반적으로 우리가 생각하는 toy 데이터들은 굉장히 깨끗한 형태로 올라오지만 실제로 DB에 있는 데이터들을 가져오면 굉장히 지저분하기 때문에 전처리를 많이 해주어야한다. DB에 있는 데이터들이 너무 크면 전처리 시간이 너무 오래 걸리기 때문에 이러한 시간을 줄이기 위해서 Pandas라는 것을 통해 깨끗한 형태로 바꾸어 보고자 하는 것이다.

# 8. Groupby

## Groupby

- SQL groupby 명령어와 같음 
- split -> apply -> combine
- 과정을 거쳐 연산함
- 일반적으로 통계치를 낼 때 많이 사용한다.

<img src="../../img/Screen Shot 2019-03-18 at 6.14.35 PM.png" width="400">

In [152]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
                     'Kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
            'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
            'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
            'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

In [153]:
df = pd.DataFrame(ipl_data)

In [154]:
print(df)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

<img src="../../img/Screen Shot 2019-03-18 at 6.19.40 PM.png" width="600">

In [155]:
df.groupby("Team")["Points"].sum()

Team
Devils    1536
Kings     3097
Riders    3049
Royals    1505
Name: Points, dtype: int64

- 한 개 이상의 column을 묶을 수도 있음

In [156]:
df.groupby(["Team", "Year"])["Points"].sum()

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2015    812
        2016    756
        2017    788
Riders  2014    876
        2015    789
        2016    694
        2017    690
Royals  2014    701
        2015    804
Name: Points, dtype: int64

## Hierarchical index

- Groupby 명령의 결과물도 결국은 dataframe
- 두 개의 column으로 groupby를 할 경우, index가 두개 생성
- **index가 두개 이상 생성** 될 때 어떻게 다룰 것이냐

In [157]:
h_index = df.groupby(["Team", "Year"])["Points"].sum()

In [158]:
print(h_index)

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2015    812
        2016    756
        2017    788
Riders  2014    876
        2015    789
        2016    694
        2017    690
Royals  2014    701
        2015    804
Name: Points, dtype: int64

In [159]:
h_index.index

MultiIndex(levels=[['Devils', 'Kings', 'Riders', 'Royals'], [2014, 2015, 2016, 2017]],
           labels=[[0, 0, 1, 1, 1, 1, 2, 2, 2, 2, 3, 3], [0, 1, 0, 1, 2, 3, 0, 1, 2, 3, 0, 1]],
           names=['Team', 'Year'])

In [160]:
h_index["Devils":"Kings"]

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2015    812
        2016    756
        2017    788
Name: Points, dtype: int64

## Hierarchical index – unstack()

- Group으로 묶여진 데이터를 matrix 형태로 전환해줌 
- Groupby를 쓰고 unstack()을 해서 matrix로 만들어 주는 것. 많이 쓰는 패턴 중 하나
- DB에 있는 값들을 feature를 생성할 때 사용하는 패턴

In [161]:
h_index.unstack() # row - Team, column - Year, values - Points

Year     2014   2015   2016   2017
Team
Devils  863.0  673.0    NaN    NaN
Kings   741.0  812.0  756.0  788.0
Riders  876.0  789.0  694.0  690.0
Royals  701.0  804.0    NaN    NaN

## Hierarchical index – swaplevel()

- Index level을 변경할 수 있음

In [162]:
h_index

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2015    812
        2016    756
        2017    788
Riders  2014    876
        2015    789
        2016    694
        2017    690
Royals  2014    701
        2015    804
Name: Points, dtype: int64

In [163]:
h_index.swaplevel()

Year  Team
2014  Devils    863
2015  Devils    673
2014  Kings     741
2015  Kings     812
2016  Kings     756
2017  Kings     788
2014  Riders    876
2015  Riders    789
2016  Riders    694
2017  Riders    690
2014  Royals    701
2015  Royals    804
Name: Points, dtype: int64

In [164]:
h_index.swaplevel().sort_index()

Year  Team
2014  Devils    863
      Kings     741
      Riders    876
      Royals    701
2015  Devils    673
      Kings     812
      Riders    789
      Royals    804
2016  Kings     756
      Riders    694
2017  Kings     788
      Riders    690
Name: Points, dtype: int64

## Hierarchical index – operations

- Index level을 기준으로 기본 연산 수행 가능
- 별로 많이 쓰진 않음

In [165]:
h_index

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2015    812
        2016    756
        2017    788
Riders  2014    876
        2015    789
        2016    694
        2017    690
Royals  2014    701
        2015    804
Name: Points, dtype: int64

In [166]:
h_index.sum(level=0) # level=0이면 첫 번째 column을 기준

Team
Devils    1536
Kings     3097
Riders    3049
Royals    1505
Name: Points, dtype: int64

In [167]:
h_index.sum(level=1) # level=1이면 두 번째 column을 기준

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

아래부터는 Groupby 중에서 이러한 것들이 있다 정도로만 알면 된다. 잘 쓰이진 않는다.

## Groupby – gropued

- Groupby에 의해 Split된 상태를 추출 가능함
- Tuple 형태로 그룹의 key 값 Value값이 추출됨

In [168]:
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [169]:
grouped = df.groupby("Team")

In [170]:
grouped

In [171]:
for name, group in grouped:
    print(name)
    print(group)

Devils
     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673
Kings
    Team  Rank  Year  Points
4  Kings     3  2014     741
5  Kings     4  2015     812
6  Kings     1  2016     756
7  Kings     1  2017     788
Riders
      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
8   Riders     2  2016     694
11  Riders     2  2017     690
Royals
      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804

- 특정 key값을 가진 그룹의 정보만 추출 가능

In [172]:
grouped.get_group("Devils")

     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673

- 추출된 group 정보에는 세 가지 유형의 apply가 가능함 
- Aggregation: 요약된 통계정보를 추출해 줌
- Transformation: 해당 정보를 변환해줌
- Filtration: 특정 정보를 제거 하여 보여주는 필터링 기능
- 일반적으로 데이터 분석보다는 데이터에 대해서 통계치를 뽑을 때 가끔 사용한다.

## Groupby – aggregation

- 요약된 통계정보를 추출해 줌

In [173]:
grouped.agg(sum)

        Rank  Year  Points
Team
Devils     5  4029    1536
Kings      9  8062    3097
Riders     7  8062    3049
Royals     5  4029    1505

In [174]:
grouped.agg(np.mean)

        Rank    Year  Points
Team
Devils  2.50  2014.5  768.00
Kings   2.25  2015.5  774.25
Riders  1.75  2015.5  762.25
Royals  2.50  2014.5  752.50

- 특정 컬럼에 여러개의 function을 Apply 할 수도 있음

In [175]:
grouped['Points'].agg([np.sum, np.mean, np.std])

         sum    mean         std
Team
Devils  1536  768.00  134.350288
Kings   3097  774.25   31.899582
Riders  3049  762.25   88.567771
Royals  1505  752.50   72.831998

## Groupby – transformation

- 해당 정보를 변환해줌
- Aggregation과 달리 key값 별로 요약된 정보가 아님 
- 개별 데이터의 변환을 지원함

$z_i = \frac{x_i-\mu}{\sigma}$

In [176]:
score = lambda x: (x - x.mean()) / x.std()
grouped.transform(score)

        Rank      Year    Points
0  -1.500000 -1.161895  1.284327
1   0.500000 -0.387298  0.302029
2  -0.707107 -0.707107  0.707107
3   0.707107  0.707107 -0.707107
4   0.500000 -1.161895 -1.042333
5   1.166667 -0.387298  1.183401
6  -0.833333  0.387298 -0.572108
7  -0.833333  1.161895  0.431040
8   0.500000  0.387298 -0.770596
9   0.707107 -0.707107 -0.707107
10 -0.707107  0.707107  0.707107
11  0.500000  1.161895 -0.815759

## Groupby – filter

- 특정 정보를 제거 하여 보여주는 필터링 기능
- 특정 조건으로 데이터를 검색할 때 사용
- 그나마 검색할 때 많이 쓸일이 있다.

In [177]:
df.groupby('Team')

In [178]:
for name, group in grouped:
    print(name)
    print(group)

Devils
     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673
Kings
    Team  Rank  Year  Points
4  Kings     3  2014     741
5  Kings     4  2015     812
6  Kings     1  2016     756
7  Kings     1  2017     788
Riders
      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
8   Riders     2  2016     694
11  Riders     2  2017     690
Royals
      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804

In [179]:
df.groupby('Team').filter(lambda x: len(x) >= 3)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690

filter안에는 boolean 조건이 존재해야하고, len(x)는 grouped된 dataframe 개수이다.

In [180]:
df.groupby('Team').filter(lambda x: x["Points"].max() > 800)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

---

# 9. Case study

## Data

- 시간과 데이터 종류가 정리된 통화량 데이터
- https://www.shanelynn.ie/wp-content/uploads/2015/06/phone_data.csv

In [181]:
import dateutil

dateutil 패키지의 parse 명령을 쓰면 자동으로 형식 문자열을 찾아 datetime.datetime 클래스 객체를 만들어 준다.

In [182]:
df_phone = pd.read_csv("./phone_data.csv")

In [183]:
df_phone.head()

   index            date  duration  item    month   network network_type
0      0  15/10/14 06:58    34.429  data  2014-11      data         data
1      1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3      3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4      4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile

In [184]:
df_phone['date'] = df_phone['date'].apply(dateutil.parser.parse, dayfirst=True)

In [185]:
df_phone.head()

   index                date  duration  item    month   network network_type
0      0 2014-10-15 06:58:00    34.429  data  2014-11      data         data
1      1 2014-10-15 06:58:00    13.000  call  2014-11  Vodafone       mobile
2      2 2014-10-15 14:46:00    23.000  call  2014-11    Meteor       mobile
3      3 2014-10-15 14:48:00     4.000  call  2014-11     Tesco       mobile
4      4 2014-10-15 17:27:00     4.000  call  2014-11     Tesco       mobile

In [186]:
df_phone.groupby('month')['duration'].sum()

month
2014-11    26639.441
2014-12    14641.870
2015-01    18223.299
2015-02    15522.299
2015-03    22750.441
Name: duration, dtype: float64

In [187]:
df_phone[df_phone['item'] == 'call'].groupby('month')['duration'].sum()

month
2014-11    25547.0
2014-12    13561.0
2015-01    17070.0
2015-02    14416.0
2015-03    21727.0
Name: duration, dtype: float64

In [188]:
df_phone.item.unique()

array(['data', 'call', 'sms'], dtype=object)

In [189]:
df_phone.groupby(['month', 'item'])['duration'].sum()

month    item
2014-11  call    25547.000
         data      998.441
         sms        94.000
2014-12  call    13561.000
         data     1032.870
         sms        48.000
2015-01  call    17070.000
         data     1067.299
         sms        86.000
2015-02  call    14416.000
         data     1067.299
         sms        39.000
2015-03  call    21727.000
         data      998.441
         sms        25.000
Name: duration, dtype: float64

In [190]:
df_phone.groupby(['month', 'item'])['date'].count().unstack()

item     call  data  sms
month
2014-11   107    29   94
2014-12    79    30   48
2015-01    88    31   86
2015-02    67    31   39
2015-03    47    29   25

여기서부터는 잘 안쓰이는 것들이지만 한번 연습삼아 해보고 넘어가자.

In [191]:
df_phone.groupby('month', as_index=False).agg(sum)

     month   index   duration
0  2014-11   26337  26639.441
1  2014-12   48362  14641.870
2  2015-01  100259  18223.299
3  2015-02   90398  15522.299
4  2015-03   78679  22750.441

index는 필요없으므로 다음과 같이 해보자.

In [192]:
df_phone.groupby('month', as_index=False).agg({"duration": "sum"}) # duration column을 sum해준다.

     month   duration
0  2014-11  26639.441
1  2014-12  14641.870
2  2015-01  18223.299
3  2015-02  15522.299
4  2015-03  22750.441

as_index=True로 하면 다음과 같이 된다.

In [193]:
df_phone.groupby('month').agg({"duration": "sum"})

          duration
month
2014-11  26639.441
2014-12  14641.870
2015-01  18223.299
2015-02  15522.299
2015-03  22750.441

쿼리문제 1

- Find the sum of the durations for each group
- Find the number of network type entries
- Get the first date per group

In [194]:
df_phone.groupby(['month', 'item']).agg({'duration': sum,     
                                     'network_type': "count",
                                     'date': 'first'})

               duration  network_type                date
month   item
2014-11 call  25547.000           107 2014-10-15 06:58:00
        data    998.441            29 2014-10-15 06:58:00
        sms      94.000            94 2014-10-16 22:18:00
2014-12 call  13561.000            79 2014-11-14 17:24:00
        data   1032.870            30 2014-11-13 06:58:00
        sms      48.000            48 2014-11-14 17:28:00
2015-01 call  17070.000            88 2014-12-15 20:03:00
        data   1067.299            31 2014-12-13 06:58:00
        sms      86.000            86 2014-12-15 19:56:00
2015-02 call  14416.000            67 2015-01-15 10:36:00
        data   1067.299            31 2015-01-13 06:58:00
        sms      39.000            39 2015-01-15 12:23:00
2015-03 call  21727.000            47 2015-02-12 20:15:00
        data    998.441            29 2015-02-13 06:58:00
        sms      25.000            25 2015-02-19 18:46:00

쿼리문제 2

- Find the min, max, and sum of the duration column
- Find the number of network type entries
- Get the min, first, and number of nunique dates

In [195]:
df_phone.groupby(['month', 'item']).agg({'duration': min,      
                                     'network_type': "count", 
                                 'date': [min, 'first', 'nunique']}) # nunique - nunber of unique
# nunique - 하나만 있는 것이 아니라 2개 이상인 것들의 갯수

             duration network_type                date                      \
                  min        count                 min               first
month   item
2014-11 call    1.000          107 2014-10-15 06:58:00 2014-10-15 06:58:00
        data   34.429           29 2014-10-15 06:58:00 2014-10-15 06:58:00
        sms     1.000           94 2014-10-16 22:18:00 2014-10-16 22:18:00
2014-12 call    2.000           79 2014-11-14 17:24:00 2014-11-14 17:24:00
        data   34.429           30 2014-11-13 06:58:00 2014-11-13 06:58:00
        sms     1.000           48 2014-11-14 17:28:00 2014-11-14 17:28:00
2015-01 call    2.000           88 2014-12-15 20:03:00 2014-12-15 20:03:00
        data   34.429           31 2014-12-13 06:58:00 2014-12-13 06:58:00
        sms     1.000           86 2014-12-15 19:56:00 2014-12-15 19:56:00
2015-02 call    1.000           67 2015-01-15 10:36:00 2015-01-15 10:36:00
        data   34.429           31 2015-01-13 06:58:00 2015-01-13 06:58:00
        sms     1.000           39 2015-01-15 12:23:00 2015-01-15 12:23:00
2015-03 call    2.000           47 2015-02-12 20:15:00 2015-02-12 20:15:00
        data   34.429           29 2015-02-13 06:58:00 2015-02-13 06:58:00
        sms     1.000           25 2015-02-19 18:46:00 2015-02-19 18:46:00


             nunique
month   item
2014-11 call     104
        data      29
        sms       79
2014-12 call      76
        data      30
        sms       41
2015-01 call      84
        data      31
        sms       58
2015-02 call      67
        data      31
        sms       27
2015-03 call      47
        data      29
        sms       17

---

# 10. Pivot table & Crosstab

- 기본적으로 groupby로 다 가능하다. 특수한 경우에만 Pivot table이나 Crosstab을 사용한다.
- 앞에서 배웠던 unstack()과 동일하다.

## Pivot Table

- 우리가 Excel에서 보던 그 것!
- Index 축은 groupby와 동일함
- Column에 추가로 labelling 값을 추가하여,
- Value에 numeric type 값을 aggregation 하는 형태

In [196]:
df_phone = pd.read_csv("./phone_data.csv")

In [197]:
df_phone['date'] = df_phone['date'].apply(dateutil.parser.parse, dayfirst=True)

In [198]:
df_phone.head()

   index                date  duration  item    month   network network_type
0      0 2014-10-15 06:58:00    34.429  data  2014-11      data         data
1      1 2014-10-15 06:58:00    13.000  call  2014-11  Vodafone       mobile
2      2 2014-10-15 14:46:00    23.000  call  2014-11    Meteor       mobile
3      3 2014-10-15 14:48:00     4.000  call  2014-11     Tesco       mobile
4      4 2014-10-15 17:27:00     4.000  call  2014-11     Tesco       mobile

In [199]:
df_phone.pivot_table(["duration"],
                     index=[df_phone.month, df_phone.item], 
                     columns=df_phone.network, aggfunc="sum", fill_value=0)

             duration                                                   \
network        Meteor Tesco  Three Vodafone      data landline special
month   item
2014-11 call     1521  4045  12458     4316     0.000     2906       0
        data        0     0      0        0   998.441        0       0
        sms        10     3     25       55     0.000        0       1
2014-12 call     2010  1819   6316     1302     0.000     1424       0
        data        0     0      0        0  1032.870        0       0
        sms        12     1     13       18     0.000        0       0
2015-01 call     2207  2904   6445     3626     0.000     1603       0
        data        0     0      0        0  1067.299        0       0
        sms        10     3     33       40     0.000        0       0
2015-02 call     1188  4087   6279     1864     0.000      730       0
        data        0     0      0        0  1067.299        0       0
        sms         1     2     11       23     0.000        0       2
2015-03 call      274   973   4966     3513     0.000    11770       0
        data        0     0      0        0   998.441        0       0
        sms         0     4      5       13     0.000        0       0


network      voicemail world
month   item
2014-11 call       301     0
        data         0     0
        sms          0     0
2014-12 call       690     0
        data         0     0
        sms          0     4
2015-01 call       285     0
        data         0     0
        sms          0     0
2015-02 call       268     0
        data         0     0
        sms          0     0
2015-03 call       231     0
        data         0     0
        sms          0     3

## Crosstab

- 두 column에 교차 빈도, 비율, 덧셈 등을 구할 때 사용 
- Pivot table의 특수한 형태
- User-Item Rating Matrix 등을 만들 때 사용가능함

In [200]:
df_movie = pd.read_csv("./movie_rating.csv")

In [201]:
df_movie

           critic               title  rating
0   Jack Matthews   Lady in the Water     3.0
1   Jack Matthews   Snakes on a Plane     4.0
2   Jack Matthews   You Me and Dupree     3.5
3   Jack Matthews    Superman Returns     5.0
4   Jack Matthews  The Night Listener     3.0
5    Mick LaSalle   Lady in the Water     3.0
6    Mick LaSalle   Snakes on a Plane     4.0
7    Mick LaSalle        Just My Luck     2.0
8    Mick LaSalle    Superman Returns     3.0
9    Mick LaSalle   You Me and Dupree     2.0
10   Mick LaSalle  The Night Listener     3.0
11   Claudia Puig   Snakes on a Plane     3.5
12   Claudia Puig        Just My Luck     3.0
13   Claudia Puig   You Me and Dupree     2.5
14   Claudia Puig    Superman Returns     4.0
15   Claudia Puig  The Night Listener     4.5
16      Lisa Rose   Lady in the Water     2.5
17      Lisa Rose   Snakes on a Plane     3.5
18      Lisa Rose        Just My Luck     3.0
19      Lisa Rose    Superman Returns     3.5
20      Lisa Rose  The Night Listener     3.0
21      Lisa Rose   You Me and Dupree     2.5
22           Toby   Snakes on a Plane     4.5
23           Toby    Superman Returns     4.0
24           Toby   You Me and Dupree     1.0
25   Gene Seymour   Lady in the Water     3.0
26   Gene Seymour   Snakes on a Plane     3.5
27   Gene Seymour        Just My Luck     1.5
28   Gene Seymour    Superman Returns     5.0
29   Gene Seymour   You Me and Dupree     3.5
30   Gene Seymour  The Night Listener     3.0

In [202]:
pd.crosstab(index=df_movie.critic, columns=df_movie.title, values=df_movie.rating,
            aggfunc="first").fillna(0)

title,Just My Luck,Lady in the Water,Snakes on a Plane,Superman Returns,The Night Listener,You Me and Dupree
critic,,,,,,
Claudia Puig,3.0,0.0,3.5,4.0,4.5,2.5
Gene Seymour,1.5,3.0,3.5,5.0,3.0,3.5
Jack Matthews,0.0,3.0,4.0,5.0,3.0,3.5
Lisa Rose,3.0,2.5,3.5,3.5,3.0,2.5
Mick LaSalle,2.0,3.0,4.0,3.0,3.0,2.0
Toby,0.0,0.0,4.5,4.0,0.0,1.0

In [203]:
df_movie.pivot_table(["rating"], index=df_movie.critic, columns=df_movie.title,
                     aggfunc="sum", fill_value=0)

                    rating                                      \
title         Just My Luck Lady in the Water Snakes on a Plane
critic
Claudia Puig           3.0               0.0               3.5
Gene Seymour           1.5               3.0               3.5
Jack Matthews          0.0               3.0               4.0
Lisa Rose              3.0               2.5               3.5
Mick LaSalle           2.0               3.0               4.0
Toby                   0.0               0.0               4.5


title         Superman Returns The Night Listener You Me and Dupree
critic
Claudia Puig               4.0                4.5               2.5
Gene Seymour               5.0                3.0               3.5
Jack Matthews              5.0                3.0               3.5
Lisa Rose                  3.5                3.0               2.5
Mick LaSalle               3.0                3.0               2.0
Toby                       4.0                0.0               1.0

In [204]:
df_movie.groupby(["critic","title"]).agg({"rating":"first"}).unstack().fillna(0)

                    rating                                      \
title         Just My Luck Lady in the Water Snakes on a Plane
critic
Claudia Puig           3.0               0.0               3.5
Gene Seymour           1.5               3.0               3.5
Jack Matthews          0.0               3.0               4.0
Lisa Rose              3.0               2.5               3.5
Mick LaSalle           2.0               3.0               4.0
Toby                   0.0               0.0               4.5


title         Superman Returns The Night Listener You Me and Dupree
critic
Claudia Puig               4.0                4.5               2.5
Gene Seymour               5.0                3.0               3.5
Jack Matthews              5.0                3.0               3.5
Lisa Rose                  3.5                3.0               2.5
Mick LaSalle               3.0                3.0               2.0
Toby                       4.0                0.0               1.0

---

# 11. Merge & Concat

## Merge

- SQL에서 많이 사용하는 Merge와 같은 기능 
- 두 개의 데이터를 하나로 합침
- 많이 사용

In [205]:
raw_data = {'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
            'test_score': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

In [206]:
df_a = pd.DataFrame(raw_data, columns = ['subject_id', 'test_score'])

In [207]:
df_a

  subject_id  test_score
0          1          51
1          2          15
2          3          15
3          4          61
4          5          16
5          7          14
6          8          15
7          9           1
8         10          61
9         11          16

In [208]:
raw_data = {'subject_id': ['4', '5', '6', '7', '8'],
            'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
            'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

In [209]:
df_b = pd.DataFrame(raw_data, columns = ['subject_id', 'first_name', 'last_name'])

In [210]:
df_b

  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

- subject_id 기준으로 merge (inner join)

In [211]:
pd.merge(df_a, df_b, on='subject_id')

  subject_id  test_score first_name last_name
0          4          61      Billy    Bonder
1          5          16      Brian     Black
2          7          14      Bryce     Brice
3          8          15      Betty    Btisan

- 두 dataframe이 column이름이 다를 때 (inner join)

In [212]:
pd.merge(df_a, df_b, left_on='subject_id', right_on='subject_id')

  subject_id  test_score first_name last_name
0          4          61      Billy    Bonder
1          5          16      Brian     Black
2          7          14      Bryce     Brice
3          8          15      Betty    Btisan

## Join method

<img src="../../img/Screen Shot 2019-03-18 at 8.36.18 PM.png" width="500">

## Left join

In [213]:
pd.merge(df_a, df_b, on='subject_id', how='left')

  subject_id  test_score first_name last_name
0          1          51        NaN       NaN
1          2          15        NaN       NaN
2          3          15        NaN       NaN
3          4          61      Billy    Bonder
4          5          16      Brian     Black
5          7          14      Bryce     Brice
6          8          15      Betty    Btisan
7          9           1        NaN       NaN
8         10          61        NaN       NaN
9         11          16        NaN       NaN

## Right join

In [214]:
pd.merge(df_a, df_b, on='subject_id', how='right')

  subject_id  test_score first_name last_name
0          4        61.0      Billy    Bonder
1          5        16.0      Brian     Black
2          7        14.0      Bryce     Brice
3          8        15.0      Betty    Btisan
4          6         NaN       Bran   Balwner

## Full(outer) join

In [215]:
pd.merge(df_a, df_b, on='subject_id', how='outer')

   subject_id  test_score first_name last_name
0           1        51.0        NaN       NaN
1           2        15.0        NaN       NaN
2           3        15.0        NaN       NaN
3           4        61.0      Billy    Bonder
4           5        16.0      Brian     Black
5           7        14.0      Bryce     Brice
6           8        15.0      Betty    Btisan
7           9         1.0        NaN       NaN
8          10        61.0        NaN       NaN
9          11        16.0        NaN       NaN
10          6         NaN       Bran   Balwner

## Inner join

In [216]:
pd.merge(df_a, df_b, on='subject_id', how='inner')

  subject_id  test_score first_name last_name
0          4          61      Billy    Bonder
1          5          16      Brian     Black
2          7          14      Bryce     Brice
3          8          15      Betty    Btisan

In [217]:
pd.merge(df_a, df_b, on='subject_id')

  subject_id  test_score first_name last_name
0          4          61      Billy    Bonder
1          5          16      Brian     Black
2          7          14      Bryce     Brice
3          8          15      Betty    Btisan

In [218]:
pd.merge(df_a, df_b, left_on='subject_id', right_on='subject_id')

  subject_id  test_score first_name last_name
0          4          61      Billy    Bonder
1          5          16      Brian     Black
2          7          14      Bryce     Brice
3          8          15      Betty    Btisan

다 같은 값이 나온다.

## Index based join

- index를 둘 다 살리고 싶을 때 사용
- subject_id로 하는 것이 아니라 맨 왼쪽에 있는 index가지고 합칠 때 사용
- 거의 잘 안씀

In [219]:
pd.merge(df_a, df_b, left_index=True, right_index=True)

  subject_id_x  test_score subject_id_y first_name last_name
0            1          51            4      Billy    Bonder
1            2          15            5      Brian     Black
2            3          15            6       Bran   Balwner
3            4          61            7      Bryce     Brice
4            5          16            8      Betty    Btisan

## Concat

- 같은 형태의 데이터를 붙이는 연산작업

In [220]:
raw_data = {'subject_id': ['1', '2', '3', '4', '5'],
            'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
            'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}

In [221]:
df_a = pd.DataFrame(raw_data, columns = ['subject_id', 'first_name', 'last_name'])

In [222]:
df_a

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

In [223]:
raw_data = {'subject_id': ['4', '5', '6', '7', '8'],
            'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
            'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

In [224]:
df_b = pd.DataFrame(raw_data, columns = ['subject_id', 'first_name', 'last_name'])

In [225]:
df_b

  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [226]:
df_new = pd.concat([df_a, df_b])
df_new.reset_index()

   index subject_id first_name last_name
0      0          1       Alex  Anderson
1      1          2        Amy  Ackerman
2      2          3      Allen       Ali
3      3          4      Alice      Aoni
4      4          5     Ayoung   Atiches
5      0          4      Billy    Bonder
6      1          5      Brian     Black
7      2          6       Bran   Balwner
8      3          7      Bryce     Brice
9      4          8      Betty    Btisan

In [227]:
df_a.append(df_b)

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [228]:
df_new = pd.concat([df_a, df_b], axis=1)
df_new.reset_index()

   index subject_id first_name last_name subject_id first_name last_name
0      0          1       Alex  Anderson          4      Billy    Bonder
1      1          2        Amy  Ackerman          5      Brian     Black
2      2          3      Allen       Ali          6       Bran   Balwner
3      3          4      Alice      Aoni          7      Bryce     Brice
4      4          5     Ayoung   Atiches          8      Betty    Btisan

---

# 12. Persistence

- 혼자 사용할 때 말고 여러명이서 작업할 경우 데이터를 넘겨주고 넘겨받을 때, 데이터를 파일 형태로 만들어주는 작업들
- 세 가지 형태가 있음
    - Database persistence
    - XLS persistence
    - Pickle persistence

## DB persistence

- Data loading시 db connection 기능을 제공함
- https://www.dataquest.io/blog/python-pandas-databases/

In [229]:
!pip install pymysql

Requirement already satisfied: pymysql in /usr/local/var/pyenv/versions/3.6.5/envs/dm-env/lib/python3.6/site-packages (0.9.3)

In [230]:
import sqlite3 # pymysql <- 설치

# Database 연결 코드
conn = sqlite3.connect("./flights.db")

In [231]:
cur = conn.cursor()
cur.execute("select * from airlines limit 5;")

In [232]:
results = cur.fetchall()

In [233]:
results

[(0, '1', 'Private flight', '\\N', '-', None, None, None, 'Y'),
 (1, '2', '135 Airways', '\\N', None, 'GNL', 'GENERAL', 'United States', 'N'),
 (2, '3', '1Time Airline', '\\N', '1T', 'RNX', 'NEXTIME', 'South Africa', 'Y'),
 (3,
  '4',
  '2 Sqn No 1 Elementary Flying Training School',
  '\\N',
  None,
  'WYT',
  None,
  'United Kingdom',
  'N'),
 (4, '5', '213 Flight Unit', '\\N', None, 'TFU', None, 'Russia', 'N')]

- db 연결 conn을 사용하여 dataframe 생성

In [234]:
df_airplines = pd.read_sql_query("select * from airlines;", conn)

In [235]:
df_airplines.head()

,index,id,name,alias,iata,icao,callsign,country,active
0,0,1,Private flight,\N,-,None,None,None,Y
1,1,2,135 Airways,\N,None,GNL,GENERAL,United States,N
2,2,3,1Time Airline,\N,1T,RNX,NEXTIME,South Africa,Y
3,3,4,2 Sqn No 1 Elementary Flying Training School,\N,None,WYT,None,United Kingdom,N
4,4,5,213 Flight Unit,\N,None,TFU,None,Russia,N

In [236]:
df_routes = pd.read_sql_query("select * from routes;", conn)

In [237]:
df_routes.head()

,index,airline,airline_id,source,source_id,dest,dest_id,codeshare,stops,equipment
0,0,2B,410,AER,2965,KZN,2990,None,0,CR2
1,1,2B,410,ASF,2966,KZN,2990,None,0,CR2
2,2,2B,410,ASF,2966,MRV,2962,None,0,CR2
3,3,2B,410,CEK,2968,KZN,2990,None,0,CR2
4,4,2B,410,CEK,2968,OVB,4078,None,0,CR2

## XLS persistence

- Dataframe의 엑셀 추출 코드
- Xls 엔진으로 openpyxls 또는 XlsxWrite 사용
- https://xlsxwriter.readthedocs.io/working_with_pandas.html

In [238]:
!pip install openpyxl
!pip install XlsxWriter

Requirement already satisfied: openpyxl in /usr/local/var/pyenv/versions/3.6.5/envs/dm-env/lib/python3.6/site-packages (2.6.1)
Requirement already satisfied: jdcal in /usr/local/var/pyenv/versions/3.6.5/envs/dm-env/lib/python3.6/site-packages (from openpyxl) (1.4)
Requirement already satisfied: et-xmlfile in /usr/local/var/pyenv/versions/3.6.5/envs/dm-env/lib/python3.6/site-packages (from openpyxl) (1.0.1)
Requirement already satisfied: XlsxWriter in /usr/local/var/pyenv/versions/3.6.5/envs/dm-env/lib/python3.6/site-packages (1.1.5)

In [239]:
writer = pd.ExcelWriter('./df_routes.xlsx', engine='xlsxwriter')

In [240]:
df_routes.to_excel(writer, sheet_name='Sheet1')

In [241]:
writer.save()

## Pickle persistence

- 가장 일반적인 python 파일 persistence 
- to_pickle, read_pickle 함수 사용
- 제일 편한 방법. 제일 많이 쓰는 방법

In [242]:
df_routes.to_pickle("./df_routes.pickle")

In [243]:
df_routes_pickle = pd.read_pickle("./df_routes.pickle")

In [244]:
df_routes_pickle.head()

,index,airline,airline_id,source,source_id,dest,dest_id,codeshare,stops,equipment
0,0,2B,410,AER,2965,KZN,2990,None,0,CR2
1,1,2B,410,ASF,2966,KZN,2990,None,0,CR2
2,2,2B,410,ASF,2966,MRV,2962,None,0,CR2
3,3,2B,410,CEK,2968,KZN,2990,None,0,CR2
4,4,2B,410,CEK,2968,OVB,4078,None,0,CR2

In [245]:
df_routes_pickle.describe() # Numeric type 데이터의 요약 정보를 보여줌

              index
count  67663.000000
mean   33831.000000
std    19532.769969
min        0.000000
25%    16915.500000
50%    33831.000000
75%    50746.500000
max    67662.000000